# 开始
echo "\033[1;42m============================== 开始合并 ==============================\033[0m"

# 当前分支
cb=$(git branch | sed -n '/\* /s///p')
# 目标分支(cb 将被合并到 tb 分支)
tb="dev"
# 错误码
code=1
# 描述
msg="$1"
if [[ -z $msg ]];then
  msg="$(date '+%Y-%m-%d %H:%M:%S') 提交优化"
fi
# Git
git add .
git commit -m "$msg"
# 拉取当前分支
git pull origin "$cb"
# 检查是否成功
if [ $? -ne 0 ];then
  echo "\033[1;41m============================== Pull 远程分支 $cb 错误 ==============================\033[0m"
  exit $code
fi
# 提交当前分支
git push origin "$cb"
# 检查是否成功
if [ $? -ne 0 ];then
  echo "\033[1;41m============================== Push 远程分支 $cb 错误 ==============================\033[0m"
  exit $code
fi
# 当前分支 != 目标分支
if [[ $cb != $tb ]];then
  # 切换到目标分支
  git checkout "$tb"
  # 拉取目标分支
  git pull origin "$tb"
  # 检查是否成功
  if [ $? -ne 0 ];then
    echo "\033[1;41m============================== Pull 远程分支 $tb 错误 ==============================\033[0m"
    exit $code
  fi
  # 提交当前分支
  git push origin "$tb"
  # 检查是否成功
  if [ $? -ne 0 ];then
    echo "\033[1;41m============================== Push 远程分支 $tb 错误 ==============================\033[0m"
    exit $code
  fi
  # 切回当前分支
  git checkout "$cb"
fi

# 结束
echo "\033[1;42m============================== 合并成功 ==============================\033[0m"